<a href="https://colab.research.google.com/github/supriyaohdar/Flight-Price-Prediction/blob/main/Flight_Ticket.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Flight Ticket Price Prediction

#Import Libraries

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
#from google.colab import files
#uploaded = files.upload()

In [ ]:
traindata=pd.read_excel("Data_Train.xlsx")
testdata=pd.read_excel("Test_set.xlsx")

In [ ]:
traindata.head()

       Airline Date_of_Journey    Source  ... Total_Stops Additional_Info  Price
0       IndiGo      24/03/2019  Banglore  ...    non-stop         No info   3897
1    Air India       1/05/2019   Kolkata  ...     2 stops         No info   7662
2  Jet Airways       9/06/2019     Delhi  ...     2 stops         No info  13882
3       IndiGo      12/05/2019   Kolkata  ...      1 stop         No info   6218
4       IndiGo      01/03/2019  Banglore  ...      1 stop         No info  13302

[5 rows x 11 columns]

In [ ]:
testdata.head()

             Airline Date_of_Journey  ... Total_Stops              Additional_Info
0        Jet Airways       6/06/2019  ...      1 stop                      No info
1             IndiGo      12/05/2019  ...      1 stop                      No info
2        Jet Airways      21/05/2019  ...      1 stop  In-flight meal not included
3  Multiple carriers      21/05/2019  ...      1 stop                      No info
4           Air Asia      24/06/2019  ...    non-stop                      No info

[5 rows x 10 columns]

In [ ]:
traindata.shape

(10683, 11)

In [ ]:
testdata.shape

(2671, 10)

In [ ]:
traindata.describe(include="all")

            Airline Date_of_Journey  ... Additional_Info         Price
count         10683           10683  ...           10683  10683.000000
unique           12              44  ...              10           NaN
top     Jet Airways      18/05/2019  ...         No info           NaN
freq           3849             504  ...            8345           NaN
mean            NaN             NaN  ...             NaN   9087.064121
std             NaN             NaN  ...             NaN   4611.359167
min             NaN             NaN  ...             NaN   1759.000000
25%             NaN             NaN  ...             NaN   5277.000000
50%             NaN             NaN  ...             NaN   8372.000000
75%             NaN             NaN  ...             NaN  12373.000000
max             NaN             NaN  ...             NaN  79512.000000

[11 rows x 11 columns]

1 value for Route and Total_Stops are missing

In [ ]:
testdata.describe(include="all")

            Airline Date_of_Journey Source  ... Duration Total_Stops Additional_Info
count          2671            2671   2671  ...     2671        2671            2671
unique           11              44      5  ...      320           5               6
top     Jet Airways       9/05/2019  Delhi  ...   2h 50m      1 stop         No info
freq            897             144   1145  ...      122        1431            2148

[4 rows x 10 columns]

In [ ]:
traindata.drop(columns=[ 'Route','Dep_Time','Arrival_Time'], axis=1, inplace=True)
testdata.drop(columns=[ 'Route','Dep_Time','Arrival_Time'], axis=1, inplace=True)

Filling missing value of Total_Stops column

In [ ]:
traindata["Total_Stops"].fillna(0, inplace = True)

#Label Encoding

For Airline

In [ ]:
traindata['Airline'].value_counts()

Jet Airways                          3849
IndiGo                               2053
Air India                            1752
Multiple carriers                    1196
SpiceJet                              818
Vistara                               479
Air Asia                              319
GoAir                                 194
Multiple carriers Premium economy      13
Jet Airways Business                    6
Vistara Premium economy                 3
Trujet                                  1
Name: Airline, dtype: int64

In [ ]:
testdata['Airline'].value_counts()

Jet Airways                          897
IndiGo                               511
Air India                            440
Multiple carriers                    347
SpiceJet                             208
Vistara                              129
Air Asia                              86
GoAir                                 46
Multiple carriers Premium economy      3
Vistara Premium economy                2
Jet Airways Business                   2
Name: Airline, dtype: int64

In [ ]:
set(traindata['Airline']) == set(testdata['Airline'])

False

Making the set same

In [ ]:
traindata['Airline'] = traindata['Airline'].replace(['Trujet'], 'IndiGo')

In [ ]:
set(traindata['Airline']) == set(testdata['Airline'])

True

 The label encoding of both the object feature can be done.

In [ ]:
from sklearn.preprocessing import LabelEncoder

labelencoder = LabelEncoder()
traindata['Airline'] = labelencoder.fit_transform(traindata['Airline'])
testdata['Airline'] = labelencoder.transform(testdata['Airline'])
traindata.head()

   Airline Date_of_Journey    Source  ... Total_Stops Additional_Info  Price
0        3      24/03/2019  Banglore  ...    non-stop         No info   3897
1        1       1/05/2019   Kolkata  ...     2 stops         No info   7662
2        4       9/06/2019     Delhi  ...     2 stops         No info  13882
3        3      12/05/2019   Kolkata  ...      1 stop         No info   6218
4        3      01/03/2019  Banglore  ...      1 stop         No info  13302

[5 rows x 8 columns]

For Source

In [ ]:
traindata['Source'].value_counts()

Delhi       4537
Kolkata     2871
Banglore    2197
Mumbai       697
Chennai      381
Name: Source, dtype: int64

In [ ]:
testdata['Source'].value_counts()

Delhi       1145
Kolkata      710
Banglore     555
Mumbai       186
Chennai       75
Name: Source, dtype: int64

In [ ]:
set(traindata['Source']) == set(testdata['Source'])

True

The label encoding of both the object feature can be done.

In [ ]:
labelencoder = LabelEncoder()
traindata['Source'] = labelencoder.fit_transform(traindata['Source'])
testdata['Source'] = labelencoder.transform(testdata['Source'])
traindata.head()

   Airline Date_of_Journey  Source  ... Total_Stops Additional_Info  Price
0        3      24/03/2019       0  ...    non-stop         No info   3897
1        1       1/05/2019       3  ...     2 stops         No info   7662
2        4       9/06/2019       2  ...     2 stops         No info  13882
3        3      12/05/2019       3  ...      1 stop         No info   6218
4        3      01/03/2019       0  ...      1 stop         No info  13302

[5 rows x 8 columns]

For Destination

In [ ]:
traindata['Destination'].value_counts()

Cochin       4537
Banglore     2871
Delhi        1265
New Delhi     932
Hyderabad     697
Kolkata       381
Name: Destination, dtype: int64

In [ ]:
traindata['Destination'].value_counts()

Cochin       4537
Banglore     2871
Delhi        1265
New Delhi     932
Hyderabad     697
Kolkata       381
Name: Destination, dtype: int64

In [ ]:
set(traindata['Destination']) == set(testdata['Destination'])

True

The label encoding of both the object feature can be done.

In [ ]:
traindata['Destination'] = labelencoder.fit_transform(traindata['Destination'])
testdata['Destination'] = labelencoder.transform(testdata['Destination'])
traindata.head()

   Airline Date_of_Journey  Source  ...  Total_Stops Additional_Info  Price
0        3      24/03/2019       0  ...     non-stop         No info   3897
1        1       1/05/2019       3  ...      2 stops         No info   7662
2        4       9/06/2019       2  ...      2 stops         No info  13882
3        3      12/05/2019       3  ...       1 stop         No info   6218
4        3      01/03/2019       0  ...       1 stop         No info  13302

[5 rows x 8 columns]

For Total_Stops

In [ ]:
traindata['Total_Stops'].value_counts()

1 stop      5625
non-stop    3491
2 stops     1520
3 stops       45
4 stops        1
0              1
Name: Total_Stops, dtype: int64

In [ ]:
testdata['Total_Stops'].value_counts()

1 stop      1431
non-stop     849
2 stops      379
3 stops       11
4 stops        1
Name: Total_Stops, dtype: int64

In [ ]:
set(traindata['Total_Stops']) == set(testdata['Total_Stops'])

False

Making the set same

In [ ]:
traindata['Total_Stops'] = traindata['Total_Stops'].replace([0], '1 stop')

In [ ]:
set(traindata['Total_Stops']) == set(testdata['Total_Stops'])

True

The label encoding of both the object feature can be done.

In [ ]:
traindata['Total_Stops'] = labelencoder.fit_transform(traindata['Total_Stops'])
testdata['Total_Stops'] = labelencoder.transform(testdata['Total_Stops'])
traindata.head()

   Airline Date_of_Journey  Source  ...  Total_Stops Additional_Info  Price
0        3      24/03/2019       0  ...            4         No info   3897
1        1       1/05/2019       3  ...            1         No info   7662
2        4       9/06/2019       2  ...            1         No info  13882
3        3      12/05/2019       3  ...            0         No info   6218
4        3      01/03/2019       0  ...            0         No info  13302

[5 rows x 8 columns]

For 	Additional_Info

In [ ]:
traindata['Additional_Info'].value_counts()

No info                         8345
In-flight meal not included     1982
No check-in baggage included     320
1 Long layover                    19
Change airports                    7
Business class                     4
No Info                            3
1 Short layover                    1
Red-eye flight                     1
2 Long layover                     1
Name: Additional_Info, dtype: int64

In [ ]:
testdata['Additional_Info'].value_counts()

No info                         2148
In-flight meal not included      444
No check-in baggage included      76
Change airports                    1
Business class                     1
1 Long layover                     1
Name: Additional_Info, dtype: int64

In [ ]:
set(traindata['Additional_Info']) == set(testdata['Additional_Info'])

False

Making the set same

In [ ]:
traindata['Additional_Info'] = traindata['Additional_Info'].replace(['No Info','2 Long layover','Red-eye flight','1 Short layover'], 'No info')

In [ ]:
set(traindata['Additional_Info']) == set(testdata['Additional_Info'])

True

The label encoding of both the object feature can be done.

In [ ]:
traindata['Additional_Info'] = labelencoder.fit_transform(traindata['Additional_Info'])
testdata['Additional_Info'] = labelencoder.transform(testdata['Additional_Info'])
traindata.head()

   Airline Date_of_Journey  Source  ...  Total_Stops Additional_Info  Price
0        3      24/03/2019       0  ...            4               5   3897
1        1       1/05/2019       3  ...            1               5   7662
2        4       9/06/2019       2  ...            1               5  13882
3        3      12/05/2019       3  ...            0               5   6218
4        3      01/03/2019       0  ...            0               5  13302

[5 rows x 8 columns]

Modifying Duration column

In [ ]:
traindata['Duration'] = traindata['Duration'].str[0]
testdata['Duration'] = testdata['Duration'].str[0]
traindata.head()

   Airline Date_of_Journey  Source  ...  Total_Stops Additional_Info  Price
0        3      24/03/2019       0  ...            4               5   3897
1        1       1/05/2019       3  ...            1               5   7662
2        4       9/06/2019       2  ...            1               5  13882
3        3      12/05/2019       3  ...            0               5   6218
4        3      01/03/2019       0  ...            0               5  13302

[5 rows x 8 columns]

Modifying Date_of_Journey column

In [ ]:
traindata['Date'] = traindata['Date_of_Journey'].str.split('/').str[0]
testdata['Date'] = testdata['Date_of_Journey'].str.split('/').str[0]
traindata.head()

   Airline Date_of_Journey  Source  ...  Additional_Info  Price  Date
0        3      24/03/2019       0  ...                5   3897    24
1        1       1/05/2019       3  ...                5   7662     1
2        4       9/06/2019       2  ...                5  13882     9
3        3      12/05/2019       3  ...                5   6218    12
4        3      01/03/2019       0  ...                5  13302    01

[5 rows x 9 columns]

In [ ]:
traindata['Month'] = traindata['Date_of_Journey'].str.split('/').str[1]
testdata['Month'] = testdata['Date_of_Journey'].str.split('/').str[1]
traindata.head()

   Airline Date_of_Journey  Source  ...  Price Date  Month
0        3      24/03/2019       0  ...   3897   24     03
1        1       1/05/2019       3  ...   7662    1     05
2        4       9/06/2019       2  ...  13882    9     06
3        3      12/05/2019       3  ...   6218   12     05
4        3      01/03/2019       0  ...  13302   01     03

[5 rows x 10 columns]

In [ ]:
traindata['Year'] = traindata['Date_of_Journey'].str.split('/').str[-1]
testdata['Year'] = testdata['Date_of_Journey'].str.split('/').str[-1]
traindata.head()

   Airline Date_of_Journey  Source  Destination  ...  Price  Date  Month  Year
0        3      24/03/2019       0            5  ...   3897    24     03  2019
1        1       1/05/2019       3            0  ...   7662     1     05  2019
2        4       9/06/2019       2            1  ...  13882     9     06  2019
3        3      12/05/2019       3            0  ...   6218    12     05  2019
4        3      01/03/2019       0            5  ...  13302    01     03  2019

[5 rows x 11 columns]

Dropping Date_of_Journey

In [ ]:
traindata.drop('Date_of_Journey', axis=1, inplace=True)
testdata.drop('Date_of_Journey', axis=1, inplace=True)
traindata.head()

   Airline  Source  Destination Duration  ...  Price  Date  Month  Year
0        3       0            5        2  ...   3897    24     03  2019
1        1       3            0        7  ...   7662     1     05  2019
2        4       2            1        1  ...  13882     9     06  2019
3        3       3            0        5  ...   6218    12     05  2019
4        3       0            5        4  ...  13302    01     03  2019

[5 rows x 10 columns]

In [ ]:
traindata.dtypes

Airline             int64
Source              int64
Destination         int64
Duration           object
Total_Stops         int64
Additional_Info     int64
Price               int64
Date               object
Month              object
Year               object
dtype: object

changing object data type into int

In [ ]:
traindata['Duration'] = traindata['Duration'].astype('int64')

In [ ]:
traindata['Date'] = traindata['Date'].astype('int64')

In [ ]:
traindata['Month'] = traindata['Month'].astype('int64')

In [ ]:
traindata['Year'] = traindata['Year'].astype('int64')

In [ ]:
traindata.dtypes

Airline            int64
Source             int64
Destination        int64
Duration           int64
Total_Stops        int64
Additional_Info    int64
Price              int64
Date               int64
Month              int64
Year               int64
dtype: object

moving the price column to the last

In [ ]:
traindata = traindata[['Airline', 'Source', 'Destination', 'Duration', 'Total_Stops',
       'Additional_Info', 'Date', 'Month','Year','Price']]
traindata.head()

   Airline  Source  Destination  Duration  ...  Date  Month  Year  Price
0        3       0            5         2  ...    24      3  2019   3897
1        1       3            0         7  ...     1      5  2019   7662
2        4       2            1         1  ...     9      6  2019  13882
3        3       3            0         5  ...    12      5  2019   6218
4        3       0            5         4  ...     1      3  2019  13302

[5 rows x 10 columns]

In [ ]:
traindata.shape

(10683, 10)

#split the dataset

In [ ]:
from sklearn.model_selection import train_test_split
array = traindata.values
X = array[:, 0:9]
Y = array[:, 9]
x_train, x_valid, y_train, y_valid = train_test_split(X, Y, test_size=0.20, random_state=1)

#Build the model

In [ ]:
from sklearn.linear_model import LinearRegression

model = LinearRegression()
model.fit(x_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
score = model.score(x_valid, y_valid)
score

0.36180965803670584

In [ ]:
predictions1 = model.predict(x_valid)

In [ ]:
from sklearn.metrics import mean_absolute_error

print(mean_absolute_error(y_valid, predictions1))

2648.8284131863047

In [ ]:
model1 = LinearRegression()
model1.fit(X, Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
predictions = model1.predict(testdata)
predictions

array([11595.62070317, 10857.35872979, 10429.04065017, ...,
       12316.38897665, 12727.83137146, 10901.40256612])

In [ ]:
df = pd.DataFrame({'Actual':y_valid,
                  'pred':predictions1})
df.head(50)

    Actual          pred
0     2753   5331.494203
1     6309   6753.729518
2    13731  10917.515649
3    13555  12975.512049
4    10844   9981.943139
5    14848   9720.212347
6     5911   6326.375183
7     9838  11088.031542
8     8610  11724.478054
9     4990   4780.934889
10    6093   9150.466101
11    9968   9752.152609
12    5883   9631.318603
13    6985   6147.467627
14    3749   4801.936635
15   21571  11259.214736
16    3841   5285.777577
17   16736  13862.597213
18    4667   5506.644909
19    4878   5428.078746
20   14151  11056.758581
21    3597   4945.620889
22   13376  10006.103072
23   22270  13737.045875
24    9794  11350.327702
25   10539  10708.783626
26   10406  10754.492713
27   13994  10569.540694
28    7189  10982.948095
29   10651   9773.154355
30   13044  10613.215999
31    3543   6028.337394
32   16289  12421.324628
33    7791   9530.262847
34   14067  10819.169762
35   10844  10569.540694
36    4944   6394.102250
37    8837  10375.627180
38   10877  11050.840093
39    5963  11186.264509
40    8937  11915.629068
41    4649  10742.041252
42    2754   3604.047739
43   11342   9730.939966
44   10262  10566.287547
45    6128   9566.185813
46   13712  13432.093899
47   15197  12997.744758
48   13307   9690.625995
49    2754   3382.276448

In [ ]:
#from google.colab import files
#uploaded = files.upload()

In [ ]:
sample = pd.read_excel('Sample_submission.xlsx')
sample

      Price
0     15998
1     16612
2     25572
3     25778
4     16934
...     ...
2666  14046
2667  14086
2668  22720
2669  23544
2670  27489

[2671 rows x 1 columns]

In [ ]:
df = pd.DataFrame({'Price': predictions})
df

             Price
0     11595.620703
1     10857.358730
2     10429.040650
3     10821.054016
4      4704.417085
...            ...
2666  11114.428202
2667   4313.695831
2668  12316.388977
2669  12727.831371
2670  10901.402566

[2671 rows x 1 columns]

In [ ]:
df.to_csv('Price.csv', index=False)